app/views/users/show.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
                  <% @company= blog_post.company %>
                  <% @user = User.find_by(:id => @company.user_id).username %>