app/controllers/users_controller.rb

  def index
    @company = Company.find_by_slug(params[:company_id])
    @user = User.find_by(:id => @company.user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1